import { PostProps } from '../PostProps';

export const dummyPost: PostProps[] = [
  {
    id: 1,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 15,
    tag: '학교생활',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 2,
    status: '답변완료',
    title: '청원게시판 테스트입니다.',

    likes: 8,
    tag: '교내시설',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 3,
    status: '답변완료',
    title: '청원게시판 테스트입니다.',

    likes: 10,
    tag: '코로나19',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 4,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    dueDate: '2020-01-01',
    likes: 15,
    tag: '코로나19',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 5,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    dueDate: '2020-01-01',
    likes: 22,
    tag: '장학금',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 6,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 22,
    tag: '학교생활',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 7,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 2,
    tag: '수업',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 8,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 2,
    tag: '기타',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 9,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 2,
    tag: '기타',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 10,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 2,
    tag: '기타',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 11,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 2,
    tag: '학교생활',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 12,
    status: '진행중',
    title: '청원게시판 테스트입니다.',

    likes: 2,
    tag: '장학금',
    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
  {
    id: 13,
    status: '진행중',
    title: '청원게시판 테스트입니다. (기타)',

    likes: 2,
    tag: '기타',

    commentList: [
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
      {
        id: 1,
        writer: 'SW융합대학',
        contents: '동의합니다.',
        createdAt: '2022-06-04',
      },
    ],
    createdAt: '2022-06-04',
    dueDate: '2022-12-31',
    contents: (
      <div>
        <p>
          정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을 편성하여
          국회에 제출할 수 있다. 공무원의 직무상 불법행위로 손해를 받은 국민은
          법률이 정하는 바에 의하여 국가 또는 공공단체에 정당한 배상을 청구할 수
          있다. 이 경우 공무원 자신의 책임은 면제되지 아니한다.
        </p>

        <p>
          국민의 모든 자유와 권리는 국가안전보장·질서유지 또는 공공복리를 위하여
          필요한 경우에 한하여 법률로써 제한할 수 있으며, 제한하는 경우에도
          자유와 권리의 본질적인 내용을 침해할 수 없다.
        </p>

        <p>
          국회는 국가의 예산안을 심의·확정한다. 대법원은 법률에 저촉되지
          아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과 사무처리에
          관한 규칙을 제정할 수 있다.
        </p>

        <p>
          대통령은 국가의 독립·영토의 보전·국가의 계속성과 헌법을 수호할 책무를
          진다. 대법원과 각급법원의 조직은 법률로 정한다. 혼인과 가족생활은
          개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는
          이를 보장한다.
        </p>

        <p>
          재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회는 국정을
          감사하거나 특정한 국정사안에 대하여 조사할 수 있으며, 이에 필요한
          서류의 제출 또는 증인의 출석과 증언이나 의견의 진술을 요구할 수 있다.
        </p>

        <p>
          대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는
          국무총리, 법률이 정한 국무위원의 순서로 그 권한을 대행한다. 모든
          국민은 법률이 정하는 바에 의하여 납세의 의무를 진다.
        </p>

        <p>
          국가는 여자의 복지와 권익의 향상을 위하여 노력하여야 한다.
          형사피해자는 법률이 정하는 바에 의하여 당해 사건의 재판절차에서 진술할
          수 있다. 언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는
          인정되지 아니한다.
        </p>
      </div>
    ),
  },
];
