const Bears = [
  {
    id: 0,
    title: '#나는_새삥_모든게_다_새삥',
    img: 'https://i.pinimg.com/736x/b7/82/f8/b782f8ad051d687955556eee2b6b757a.jpg',

    team: 'PLAY!',
    members: '양도균, 김수현',
    description:
      '보세옷을 걸쳤는데 어떻게 브랜드 네임을 묻죠.  그 사람 눈썰미 문제가 있는 것 같아요.  저는 곰 중의 최고 곰이라 매일 새옷만 입습니다. 자고로 곰은 마늘과 쑥향이 스며든 건강한 한의원복을 입어줘야 진정한  곰이라 할 수 있죠. 그 미만 안받습니다.',
  },
  {
    id: 1,
    title: '#나는_새삥_모든게_다_새삥',
    img: 'https://i.pinimg.com/736x/b7/82/f8/b782f8ad051d687955556eee2b6b757a.jpg',

    team: 'PLAY!',
    members: '양도균, 김수현',
    description:
      '보세옷을 걸쳤는데 어떻게 브랜드 네임을 묻죠.  그 사람 눈썰미 문제가 있는 것 같아요.  저는 곰 중의 최고 곰이라 매일 새옷만 입습니다. 자고로 곰은 마늘과 쑥향이 스며든 건강한 한의원복을 입어줘야 진정한  곰이라 할 수 있죠. 그 미만 안받습니다.',
  },
  {
    id: 2,
    title: '#나는_새삥_모든게_다_새삥',
    img: 'https://i.pinimg.com/736x/b7/82/f8/b782f8ad051d687955556eee2b6b757a.jpg',

    team: 'PLAY!',
    members: '양도균, 김수현',
    description:
      '보세옷을 걸쳤는데 어떻게 브랜드 네임을 묻죠.  그 사람 눈썰미 문제가 있는 것 같아요.  저는 곰 중의 최고 곰이라 매일 새옷만 입습니다. 자고로 곰은 마늘과 쑥향이 스며든 건강한 한의원복을 입어줘야 진정한  곰이라 할 수 있죠. 그 미만 안받습니다.',
  },
  {
    id: 3,
    title: '#나는_새삥_모든게_다_새삥',
    img: 'https://i.pinimg.com/736x/b7/82/f8/b782f8ad051d687955556eee2b6b757a.jpg',

    team: 'PLAY!',
    members: '양도균, 김수현',
    description:
      '보세옷을 걸쳤는데 어떻게 브랜드 네임을 묻죠.  그 사람 눈썰미 문제가 있는 것 같아요.  저는 곰 중의 최고 곰이라 매일 새옷만 입습니다. 자고로 곰은 마늘과 쑥향이 스며든 건강한 한의원복을 입어줘야 진정한  곰이라 할 수 있죠. 그 미만 안받습니다.',
  },
  {
    id: 4,
    title: '#나는_새삥_모든게_다_새삥',
    img: 'https://i.pinimg.com/736x/b7/82/f8/b782f8ad051d687955556eee2b6b757a.jpg',

    team: 'PLAY!',
    members: '양도균, 김수현',
    description:
      '보세옷을 걸쳤는데 어떻게 브랜드 네임을 묻죠.  그 사람 눈썰미 문제가 있는 것 같아요.  저는 곰 중의 최고 곰이라 매일 새옷만 입습니다. 자고로 곰은 마늘과 쑥향이 스며든 건강한 한의원복을 입어줘야 진정한  곰이라 할 수 있죠. 그 미만 안받습니다.',
  },
  {
    id: 5,
    title: '#나는_새삥_모든게_다_새삥',
    img: 'https://i.pinimg.com/736x/b7/82/f8/b782f8ad051d687955556eee2b6b757a.jpg',

    team: 'PLAY!',
    members: '양도균, 김수현',
    description:
      '보세옷을 걸쳤는데 어떻게 브랜드 네임을 묻죠.  그 사람 눈썰미 문제가 있는 것 같아요.  저는 곰 중의 최고 곰이라 매일 새옷만 입습니다. 자고로 곰은 마늘과 쑥향이 스며든 건강한 한의원복을 입어줘야 진정한  곰이라 할 수 있죠. 그 미만 안받습니다.',
  },
];

export { Bears };
